/**
 * @mainpage
 * # Загальне завдання
 * 1. Дано двовимірний масив з NxN цілих чисел. **Виконати циклічне зрушення**
 * елементів рядків масиву в напряму справа наліво
 * @author Yaylo D.
 * @date 22-nov-2020
 * @version 1.0
 */

/**
 * @file main.c
 * @brief Файл з демонстрацією роботи структури та методів
 * оперування ним.
 *
 * @author Yaylo D.
 * @date 22-nov-2020
 * @version 1.0
 */


#include<stdio.h>
int task (int N);

/**
 * Головна функція.
 *
 * Послідовність дій:
 * - Задання константи розміру масиву
 *   @param N Розмір масиву
 * - вивід результату роботи функції @function task
 * @return успішний код повернення з програми (0)
 */
int main()
{
    int const N =3;
    task(N);
    return 0;
}

/**
 * @function task
 *
 * Послідовність дій:
 * - оголошеня змінних 
 *	@param mas[] Масив у якому буде відбуватися зрушення
 * - Заповнення масиву за алгоритмом
 * - Поступове зрушення елементів вправо, при чому 
 *   останній елемент рядка стає на місце першого
 * - Вивід на екран результату зрушення
 */
int task(int N){
    int a;
    int mas[N][N];
    for (int i=0;i<N;i++) {
    for (int j=0;j<N;j++) //Заполнение ячеек массива суммой номера строки и столбца
        mas[i][j] = i + j; 
    }
    for (int i=0;i<N;i++) { //движение по строкам массива
        a=mas[i][0];
        for (int j=0;j<N;j++){ //движение по элементам строки и их перестановка
                mas[i][j]=mas[i][j+1];
        } 
       mas[i][N-1]=a;
    }
    for (int i=0;i<N;i++) {
    	for (int j=0;j<N;j++){
        	printf( "%d ", mas[i][j] );
    	}
    printf( "\n" );
    }
}
